src/cf/src/Documents/ОбслуживаниеСтанка/ОбслуживаниеСтанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбслуживаниеСтанка</name>
  <registerRecords>InformationRegister.ЗагрузкаСтанков</registerRecords>
  <attributes>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбслуживания</name>
    <type>
      <types>EnumRef.ВидыОбслуживанияСтанков</types>
    </type>
  </attributes>
  <attributes>
    <name>Плановое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Затраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/cf/src/InformationRegisters/ЗагрузкаСтанков/ЗагрузкаСтанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗагрузкаСтанков</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидЗаписи</name>
    <type>
      <types>EnumRef.ВидыЗагрузкиСтанков</types>
    </type>
  </resources>
  <resources>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ВидыЗагрузкиСтанков/ВидыЗагрузкиСтанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗагрузкиСтанков</name>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Обслуживание</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ОбслуживаниеСтанка/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Дата = ТекущаяДатаСеанса();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ПроизводственноеОборудование") Тогда
		Станок = ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Станок") Тогда
		Станок = ДанныеЗаполнения.Станок;
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(Начало) И ЗначениеЗаполнено(Окончание) И Окончание <= Начало Тогда
		ТекстОшибки = НСтр("ru = 'Окончание обслуживания должно быть позже начала';
			|fr = 'La fin de la maintenance doit être postérieure au début';
			|en = 'The maintenance end must be later than the start';
			|es = 'El fin del mantenimiento debe ser posterior al inicio'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Окончание", , Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Запись «Загрузки станков» под исключительной блокировкой станка: пересечение с занятым временем станка
	// (правило - ЗагрузкаСтанков.ПересеченияЗагрузки) отклоняет проведение. Привилегированный режим проведения
	// задан в свойствах документа.
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);

	Блокировка = Новый БлокировкаДанных;
	УправляемыеБлокировки.ЗагрузкаСтанков(Блокировка, Станок);
	Блокировка.Заблокировать();

	ВидЗаписи = Перечисления.ВидыЗагрузкиСтанков.Обслуживание;
	Пересечения = ЗагрузкаСтанков.ПересеченияЗагрузки(Станок, Начало, Окончание, ВидЗаписи, Плановое, Ссылка);
	Для Каждого Пересечение Из Пересечения Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ЗагрузкаСтанков.ТекстПересеченияЗагрузки(Пересечение),
			ЭтотОбъект, "Начало", , Отказ);
	КонецЦикла;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Движения.ЗагрузкаСтанков.Очистить();
	Запись = Движения.ЗагрузкаСтанков.Добавить();
	Запись.Станок = Станок;
	Запись.Начало = Начало;
	Запись.Окончание = Окончание;
	Запись.Часы = ЗагрузкаСтанков.ЧасыМеждуДатами(Начало, Окончание);
	Запись.ВидЗаписи = ВидЗаписи;
	Запись.План = Плановое;
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

#КонецОбласти
